# Student Data
This notebook analyzes pass/fail data for a class

In [39]:
data = [50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]
study_hours = [10.0, 11.5, 9.0, 16.0, 9.25, 1.0, 11.5, 9.0, 8.5, 14.5, 15.5, 13.75, 9.0, 8.0, 15.5, 8.0, 9.0, 6.0, 10.0, 12.0, 12.5, 12.0]

In [40]:
import numpy as np
import pandas as pd

grades = np.array(data)
student_data = np.array([study_hours, grades])

In [41]:
grades.shape

(22,)

In [42]:
#Average Score
grades.mean()

49.18181818181818

In [43]:
#First Item from the First Array
student_data[0][0]
#First Item from the Second Array
student_data[1][0]

50.0

In [44]:
avg_study_hours = student_data[0].mean()
avg_grade = student_data[1].mean()

print(f'Average Study Time: {avg_study_hours}\nAverage Grade: {avg_grade}')

Average Study Time: 10.522727272727273
Average Grade: 49.18181818181818

In [46]:
df_students = pd.DataFrame({'Name': ['Dan','Joann','Pedro','Rosie','Ethan'
                                     ,'Vicky','Frederic','Jimmie','Rhonda','Giovanni','Francesca'
                                     ,'Joann','Joann','Joann','Joann','Joann','Joann','Joann'
                                     ,'Joann','Joann','Daniel','Aisha'], 
                                     'StudyHours': student_data[0],
                                     'Grade': student_data[1]})

df_students

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Joann       13.75   62.0
12      Joann        9.00   37.0
13      Joann        8.00   15.0
14      Joann       15.50   70.0
15      Joann        8.00   27.0
16      Joann        9.00   36.0
17      Joann        6.00   35.0
18      Joann       10.00   48.0
19      Joann       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

In [53]:
df_students.loc[5, 'Grade']

df_students[df_students['Name']=='Joann']
df_students[df_students.Name=="Vicky"]

df_students.query('Name=="Vicky"')

    Name  StudyHours  Grade
5  Vicky         1.0    3.0